
<p> Самостоятельная работа №1
<p>
<?php
echo '<title>Абизгильдина Д.Р.</title>';

$a = rand(-20,20);
$c = rand(-20,20);
$d = rand(-20,20);
  echo '$a' . ' = ' . $a . ' $d' . ' = ' . $d . ' $c' . ' = ' . $c . '<br><br>'   ;
echo 'Вариант №1 '. '<br>';

 if ($a==4) {
	echo 'Ошибка! Деление на 0!' . '<br><br>';
	}
		 else {
			 echo '(2 * ' . $c . ' - ' . $d .') / (' . $a . '/4 - 1) = ' . (2*$c-$d)/(($a/4)-1). '<br><br>';
		 }
 echo 'Вариант №6 '. '<br>';
 if ($c+$a-1==0) {
		echo 'Ошибка! Деление на 0!' . '<br><br>';
	}
		else {
			echo '(2 * ' . $c . ' - 42 * ' . $d . ') / (' . $c . ' + ' . $a . ' -1) = ' . (2*$c-42*$d)/($c+$a-1);
		}
?>

  <ul id = "menu">
	<li> <a href="/"> Главная </a> </li>
</ul>